Tekla Open API Reference for Tekla Structures 2025
Vector.Cross Method (Vector)
 Returns a new cross product vector of the current vector and the given vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Cross(
	Vector Vector
)
Public Function Cross (
	Vector As Vector
) As Vector
Parameters
Vector
Type: Tekla.Structures.Geometry3d.Vector
The vector to be used.
Return Value
Type: Vector
The new cross product vector.
See Also
Reference
Vector Class
Cross Overload
Tekla.Structures.Geometry3d Namespace